import './data.js';
import './render-advert.js';
import './map.js';







/*
В этом задании мы добавим в проект интерактивную карту и
начнём реализацию сценария переключения режимов страницы между неактивным и
активным, который завязан на карте.

2. Реализуйте с помощью JavaScript перевод страницы в неактивное состояние,
все пункты, кроме первого про карту.

    Важно. Неактивность должна добавляться именно средствами JavaScript,
    иначе, если классы и атрибуты добавить напрямую в HTML,
    при ошибке в скриптах или ошибке загрузки скриптов сайт будет недоступен пользователю.

    Неактивное состояние. При открытии страница находится в неактивном состоянии:
    - На месте карты отображается серый прямоугольник.
    - Форма заполнения информации об объявлении .ad-form содержит класс ad-form--disabled;
    - Все интерактивные элементы формы .ad-form должны быть заблокированы с помощью атрибута disabled,
     добавленного на них или на их родительские блоки fieldset;
    - Форма с фильтрами .map__filters заблокирована так же, как и форма .ad-form — класс и атрибуты disabled;
*/
